# RoutingConditions Constructor (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
RoutingConditions Constructor
RoutingConditions Class See Also
---
Constructs a new instance of a RoutingConditions object with an indicated error level for conditions that do not meet any routing preference rule.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public RoutingConditions(
	RoutingPreferenceErrorLevel errorLevel
)
```

Visual Basic
---
```text
Public Sub New ( _
	errorLevel As RoutingPreferenceErrorLevel _
)
```

Visual C++
---
```text
public:
RoutingConditions(
	RoutingPreferenceErrorLevel errorLevel
)
```

# ### Parameters
errorLevel
    Type: Autodesk.Revit.DB..::..RoutingPreferenceErrorLevel
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | A value passed for an enumeration argument is not a member of that enumeration |

# See Also
RoutingConditions Class
Autodesk.Revit.DB Namespace